#pragma once
#include "IObject.h"
// ============================================================================
//						CWall
// ---------------------------------------------------------------------------
// 상속
// IObject <- CWall
// ----
// 벽 오브젝트
// 생성자로 좌표를 받고 그좌표에서 충돌체크를 함
// ----
// CWall(x,y)				: (x,y)에 벽생성
// Render()					: _pos 에 # 출력
// ============================================================================

class CWall : public  IObject {
public:
	CWall(int iX, int iY);
	virtual void Render();
};

