#pragma once

// ============================================================================
//							씬 관리자
// ---------------------------------------------------------------------------
// 1. Title		: 타이틀신
// 2. Load		: 로딩신
// 3. InGame	: 게임신
// 4. Ending	: 엔딩신
// ============================================================================

enum  class SceneType{
	Title = 0,
	Load,
	InGame,
	Ending
};


extern SceneType	_sceneNow;		// "현재" 게임씬 타입
extern int			_sceneStageNum; // "현재" 플레이중인 스테이지


// ============================================================================
//							씬 로딩
// ---------------------------------------------------------------------------
// 씬의 흐름
// 1. Title		: Titel -> Load -> InGmae
// 2. Load		: Load -> Ingame
// 3. InGame	: InGame -> Load -> InGame -> Load -> ... -> InGame -> Ending
// 4. Ending	: Ending 출력하고 게임 종료
// type 씬으로 이동합니다.
// 다음 업데이트부터 적용됩니다.
// ============================================================================
void Scene_Load(SceneType type);


// ============================================================================
//							다음 스테이지 로딩
// ---------------------------------------------------------------------------
// _sceneStageNum를 하나 증가시키며 다음 스테이지를 로딩합니다.
// _sceneStageNum >= _stageDataCount 이면 엔딩을 로딩합니다.
// ============================================================================
void Scene_LoadNextStage();